Revit 2027 API
BuiltInFailures.MEPCalculationFailures.NetworkDefaultToPressure Property
 The network uses the default pressure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NetworkDefaultToPressure { get; }
Public Shared ReadOnly Property NetworkDefaultToPressure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NetworkDefaultToPressure {
	FailureDefinitionId^ get ();
}
static member NetworkDefaultToPressure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace